examples/socket-io/socket-io.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 25

scenarios:
  - name: "emit_and_validate_response"
    engine: socketio
    flow:
      - namespace: /personalised
        emit:
          channel: "echo"
          data: "Hello from Artillery"
        response:
          channel: "echoResponse"
          data: "Hello from Artillery"

  - name: "emit_and_validate_acknowledgment"
    engine: socketio
    flow:
      - namespace: /personalised
        emit:
          channel: "userDetails"
        acknowledge:
          match:
            json: "$.0.name"
            value: "Artillery"